## staging: common
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 5 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                          NAME                                           |
|--------|-----------------------------------------------------------------------------------------|
| add    | `aws_cloudwatch_metric_alarm.route53-dns-failures-critical[0]`                          |
|        | `aws_cloudwatch_metric_alarm.route53-dns-failures-warning[0]`                           |
|        | `aws_route53_resolver_query_log_config.dns_query_log_config[0]`                         |
|        | `aws_route53_resolver_query_log_config.main[0]`                                         |
|        | `aws_route53_resolver_query_log_config_association.dns_query_log_config_association[0]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.route53-dns-failures-critical[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "route53-dns-failures-critical" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Alarm for Route53 DNS resolution failures exceeding threshold"
      + alarm_name                            = "route53-dns-resolution-failures-critical"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 5
      + id                                    = (known after apply)
      + insufficient_data_actions             = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + metric_name                           = "Route53DNSResolutionFailureCount"
      + namespace                             = "Route53/Resolver"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-ok",
        ]
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 20
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.route53-dns-failures-warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "route53-dns-failures-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Alarm for Route53 DNS resolution failures exceeding threshold"
      + alarm_name                            = "route53-dns-resolution-failures-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 3
      + id                                    = (known after apply)
      + metric_name                           = "Route53DNSResolutionFailureCount"
      + namespace                             = "Route53/Resolver"
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 5
      + treat_missing_data                    = "notBreaching"
    }

  # aws_route53_resolver_query_log_config.dns_query_log_config[0] will be created
  + resource "aws_route53_resolver_query_log_config" "dns_query_log_config" {
      + arn             = (known after apply)
      + destination_arn = "arn:aws:logs:us-east-1:239043911459:log-group:route53/us-east-1/239043911459/DNS/logs"
      + id              = (known after apply)
      + name            = (sensitive value)
      + owner_id        = (known after apply)
      + share_status    = (known after apply)
      + tags            = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
      + tags_all        = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
    }

  # aws_route53_resolver_query_log_config.main[0] will be created
  + resource "aws_route53_resolver_query_log_config" "main" {
      + arn             = (known after apply)
      + destination_arn = "arn:aws:logs:us-east-1:239043911459:log-group:route53/us-east-1/239043911459/DNS/logs"
      + id              = (known after apply)
      + name            = "route53-query-logging"
      + owner_id        = (known after apply)
      + share_status    = (known after apply)
      + tags            = {
          + "CostCenter"  = "notification-canada-ca-staging"
          + "Environment" = "staging"
          + "Service"     = "dns-monitoring"
        }
      + tags_all        = {
          + "CostCenter"  = "notification-canada-ca-staging"
          + "Environment" = "staging"
          + "Service"     = "dns-monitoring"
        }
    }

  # aws_route53_resolver_query_log_config_association.dns_query_log_config_association[0] will be created
  + resource "aws_route53_resolver_query_log_config_association" "dns_query_log_config_association" {
      + id                           = (known after apply)
      + resolver_query_log_config_id = (known after apply)
      + resource_id                  = "vpc-097508d1f5e243195"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.csv_bucket,
  on s3.tf line 5, in resource "aws_s3_bucket" "csv_bucket":
   5: resource "aws_s3_bucket" "csv_bucket" {

server_side_encryption_configuration is deprecated. Use the
aws_s3_bucket_server_side_encryption_configuration resource instead.

(and 69 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.ad_hoc"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.build_tables"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.primary"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.support"]
WARN - plan.json - main - Missing Common Tags: ["aws_budgets_budget.cloudwatch_data_scanned"]
WARN - plan.json - main - Missing Common Tags: ["aws_budgets_budget.notify_global"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.aws_health[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.route53_resolver_query_log[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures_us_west_2[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_us_west_2[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.contact-3-500-error-15-minutes-critical[0]"]
WARN - plan.json - main - Missing Common...
```

</details>
